/*
 * 	산술연산자 => 프로그램에서 가장 많이 사용하는 연산자 
 *  ============
 *    + , - , * ,   /     ,    %
 *    			   몫       나머지
 *    형변환 => 데이터형이 다른 경우에 연산 처리 
 *    			큰데이터형으로 변경 
 *    
 *    'A'+10
 *    65 +10 =75;
 *    char는 연산처리가 되면 무조건 int 로 변경 
 *    int이하 데이터형이 연산되면 int 로 변경 => 산술규칙
 *	  
 *	  나누기
 *	  정수/정수 = 정수
 *	  ========== 오라클: 정수/정수 = 실수	
 *			자바스크립드: 정수/정수 = 실수
 *				파이썬: 정수/정수 = 실수 
 *						정수 // 정수 = 정수 
 *    
 * */
public class 연산자_산술연산자1 {

	public static void main(String[] args) {
		

	}

}
