package com.sist.main;
/*
 * 				오버로딩 					  오버라이딩
 * 상태:	 한개의 클래스내				상속을 받은 클래스
 * 메소드: 	 	동일							동일
 * 매개변수:    다르다(데이터형/갯수)			동일
 * 리턴형:		관계없다						동일
 * 접근지정어:  관계없다					확대(축소시 오류)
 * 
 * *** 상속없이 오버라이딩이 가능
 * 		=> 익명의 클래스 
 * 
 * 	캡슐화 => 변수 private, 메소드 public
 * 							------------- 읽기 getter / 쓰기  setter
 * 	
 * 	다형성 : 오버로딩 / 오버라이딩
 * 
 * 객체 생성
 *	클래스 객체명 = new 클래스()
 *	상위클래스 객체명 = new 하위클래스()
 *		=> 여러개를 묶어서 하나의 객체로 제어
 *	오버라이딩 
 *		상위클래스 객체명 = new 하위클래스()
 *							---------------
 *							 메소드 제어
 *		----------변수제어
 *
 *	=> 상속 예외 조건
 *		------------- static, 생성자 , 초기화블럭 
 * 		
 * */
public class 상속_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
