/*
 * 	1.관련된 데이터를 묶어서 저장=> 사영
 * 	  -------------
 *  = 다른 데이터형을 묶어서 관리
 *  = 공통사용여부 , 따라 저장 여부 
 *   -------------   -------------
 *     static           instance
 *     
 *  2.배열보다 => 클래스형을 더 많이 사용한다.
 *  3.일반 데이터형과 동일하게 사용 => 사용자 정의 데이터형
 *  4.접근시 =>
 *    Student std = new Student() => 메모리 할당
 *    
 *    프로그램 : 설계
 *    설계
 *    = 변수 : 데이터
 *    = 메소드: 기능
 *    -------------
 *     class =========> 메모리에 저장 ======> 활용 =========> 객체소멸
 *     				    객체 / 인스턴스 
 *     => 생명 주기
 *      설계 ===> 저장 ===> 활용 ===>소멸
 *      소멸: GC바로 회수하지 않는다. => 프로그램 종료시에 회수
 *      => 윈도우 / 웹 =>최적화
 * */

public class 클래스_4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
